
//1.Сделать так, чтобы в тарелке с едой не могло получиться отрицательного количества еды
// (например, в миске 10 еды, а кот пытается покушать 15-20).
//2.Каждому коту нужно добавить поле сытость (когда создаем котов, они голодны).
// Если коту удалось покушать (хватило еды), сытость = true.
//3.Считаем, что если коту мало еды в тарелке, то он её просто не трогает,
// то есть не может быть наполовину сыт (это сделано для упрощения логики программы).
//4.Создать массив котов и тарелку с едой, попросить всех котов покушать из этой тарелки
// и потом вывести информацию о сытости котов в консоль.
//5.Добавить в тарелку метод, с помощью которого можно было бы добавлять еду в тарелку.
public class Main {
        public static void main(String[] args)
        {
            AnimalFactory factory = new AnimalFactory();

            Cat cat = factory.newCat(200);
            Dog dog = factory.newDog(500, 10);

            cat.runOn(150);
            cat.swimOn(5);

            dog.runOn(550);
            dog.swimOn(9);

            System.out.println("Животных создано всего: " + factory.getAnimalsCount());
            System.out.println("Собак создано всего: " + factory.getDogsCount());
            System.out.println("Кошек создано всего: " + factory.getCatsCount());
        }
    }

